app/views/restaurantes/_form.html.erb

  Endereço: <%= f.text_field :endereco %> <br/>
  Especialidade:<%= f.collection_select(:especialidade_ids, Especialidade.all.sort,
                                        :id, :nome,:prompt => true, remote: true)%> <br/>
---
SELECT `especialidades`.* FROM `especialidades`