app/views/restaurantes/show.html.erb

<b> Nota média:</b>
	<%= @restaurante.qualificacoes.average(:nota) %> <br/>
<b> Qualificações:</b>
	<%= @restaurante.qualificacoes.count %> <br/>
<b> Preço médio: </b>
	<%= valor_formatado(@restaurante.qualificacoes.average(:valor_gasto)) %> <br/> <br/>
---
SELECT AVG(`qualificacoes`.`nota`) FROM `qualificacoes` WHERE `qualificacoes`.`restaurante_id` = 54
SELECT COUNT(*) FROM `qualificacoes` WHERE `qualificacoes`.`restaurante_id` = 54
SELECT AVG(`qualificacoes`.`valor_gasto`) FROM `qualificacoes` WHERE `qualificacoes`.`restaurante_id` = 54