app/views/pratos/index.html.erb

SELECT  `receitas`.* FROM `receitas` WHERE `receitas`.`prato_id` = 1 LIMIT 1
---
        <!--<td><%= image_tag p.foto.url(:thumb) %></td> -->
                <% if p.receita.blank? %>