app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT `clientes`.* FROM `clientes`

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO `clientes` (`nome`, `idade`, `created_at`, `updated_at`) VALUES ('Luís', 34, '2015-10-11 16:31:30', '2015-10-11 16:31:30')

  def update
    respond_to do |format|
      if @cliente.update(cliente_params)
---
UPDATE `clientes` SET `nome` = 'Bianca', `updated_at` = '2015-10-11 22:34:59' WHERE `clientes`.`id` = 4

    def set_cliente
      @cliente = Cliente.find(params[:id])
---
SELECT  `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 4 LIMIT 1