app/controllers/comentarios_controller.rb

SELECT `comentarios`.* FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

INSERT INTO `comentarios` (`conteudo`, `comentavel_id`, `comentavel_type`, `created_at`, `updated_at`) VALUES ('Muito bom. Recomendo.', 1, 'Restaurante', '2015-10-16 16:13:37', '2015-10-16 16:13:37')
---
  def create
    @comentario = Comentario.new(comentario_params)

    respond_to do |format|
      if @comentario.save

DELETE FROM `comentarios` WHERE `comentarios`.`id` = 10
---
  def destroy
    @comentario.destroy

SELECT  `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 980190962 LIMIT 1
---
    def set_comentario
      @comentario = Comentario.find(params[:id])