app/controllers/especialidades_controller.rb

SELECT `especialidades`.* FROM `especialidades`  ORDER BY `especialidades`.`nome` ASC
---
  def index
    @especialidades = Especialidade.all.order(:nome)

INSERT INTO `especialidades` (`nome`, `created_at`, `updated_at`) VALUES ('Fast-food', '2016-04-16 16:58:07', '2016-04-16 16:58:07')
---
  def create
    @especialidade = Especialidade.new(especialidade_params)

    respond_to do |format|
      if @especialidade.save

SELECT  `especialidades`.* FROM `especialidades` WHERE `especialidades`.`id` = 0 LIMIT 1
DELETE FROM `especialidades` WHERE `especialidades`.`id` = 2
---
  def destroy
    @especialidade = Especialidade.find(params[:id])

    respond_to do |format|
      if @especialidade.restaurantes.first.blank?
        @especialidade.destroy

SELECT  `especialidades`.* FROM `especialidades` WHERE `especialidades`.`id` = 0 LIMIT 1
---
  def edit
    @especialidade = Especialidade.find(params[:id])

SELECT  `especialidades`.* FROM `especialidades` WHERE `especialidades`.`id` = 3 LIMIT 1
UPDATE `especialidades` SET `nome` = 'Churrasco2', `updated_at` = '2016-05-02 02:14:12' WHERE `especialidades`.`id` = 3
---
  def update
    @especialidade = Especialidade.find(params[:id])

    respond_to do |format|
      if @especialidade.update(especialidade_params)