app/controllers/pratos_controller.rb

SELECT `pratos`.* FROM `pratos`
---
	def index
		@pratos = Prato.all

INSERT INTO `pratos` (`nome`, `descricao`, `created_at`, `updated_at`) VALUES ('jabá com jerimum', 'carneseca', '2015-12-28 21:09:55', '2015-12-28 21:09:55')
---
	def create
		@prato = Prato.new(pratos_params)
		if @prato.save

SELECT  `pratos`.* FROM `pratos` WHERE `pratos`.`id` = 1 LIMIT 1
---
  def edit
    @prato = Prato.find(params[:id])

SELECT  `pratos`.* FROM `pratos` WHERE `pratos`.`id` = 1 LIMIT 1
UPDATE `pratos` SET `nome` = 'Bolo de abóbora', `updated_at` = '2016-03-20 19:01:01' WHERE `pratos`.`id` = 1
---
  def update
    @prato = Prato.find(params[:id])

    respond_to do |format|
      if @prato.update(pratos_params)