app/controllers/qualificacoes_controller.rb

  def new
    preparar_form
    @qualificacao = Qualificacao.new

    #recebendo os parâmetros da view de Cliente e Restaurantes
    if params[:cliente]
      @qualificacao.cliente = Cliente.find(params[:cliente])
    end

    if params[:restaurante]
      @qualificacao.restaurante = Restaurante.find(params[:restaurante])
---
SELECT  `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 54 LIMIT 1