app/controllers/receitas_controller.rb

SELECT  `receitas`.* FROM `receitas` WHERE `receitas`.`id` = 1 LIMIT 1
SELECT  `pratos`.* FROM `pratos` WHERE `pratos`.`prato_id` IS NULL LIMIT 1
SELECT  `receitas`.* FROM `receitas` WHERE `receitas`.`prato_id` = 2 LIMIT 1
---
	def show
	  @receita = Receita.find(params[:id])
    @prato = Prato.find(@receita.prato_id)

INSERT INTO `receitas` (`modo_preparo`, `ingredientes`, `prato_id`, `created_at`, `updated_at`) VALUES ('Misture tudo e leve ao forno', '1kg de farinha\r\n1kg de cenoura\r\n1 litro de água', 1, '2016-03-06 18:03:35', '2016-03-06 18:03:35')
---
  def create
    @receita = Receita.new(receitas_params)
    respond_to do |format|
      if @receita.save

SELECT  `receitas`.* FROM `receitas` WHERE `receitas`.`id` = 1 LIMIT 1
---
  def edit
    @receita = Receita.find(params[:id])

SELECT  `receitas`.* FROM `receitas` WHERE `receitas`.`id` = 1 LIMIT 1
UPDATE `receitas` SET `modo_preparo` = 'Misture tudo e leve ao forno\r\n durante 1h', `ingredientes` = '1kg de farinha\r\n1kg de cenoura\r\n1 litro de água\r\n1k de macarrão', `updated_at` = '2016-03-20 19:20:24' WHERE `receitas`.`id` = 1
---
def update
  @receita = Receita.find(params[:id])

  respond_to do |format|
    if @receita.update(receitas_params)