app/controllers/restaurantes_controller.rb

	def index
		#@restaurantes = Restaurante.order :nome
		#render "index"

		@restaurantes = Restaurante.order("nome").page(params['page']).per(10)
---
SELECT COUNT(*) FROM `restaurantes`
SELECT `restaurantes`.* FROM `restaurantes`  ORDER BY `restaurantes`.`nome` ASC

	def show
		@restaurante = Restaurante.find(params[:id])
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 3 LIMIT 1

	def destroy
		@restaurante = Restaurante.find(params[:id])
		@restaurante.destroy
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 4 LIMIT 1
DELETE FROM `restaurantes` WHERE `restaurantes`.`id` = 4

	def create
		@restaurante = Restaurante.new(restaurante_params)

    respond_to do |format|
      if @restaurante.save
---
INSERT INTO `restaurantes` (`nome`, `endereco`, `especialidade`, `created_at`, `updated_at`) VALUES ('Bob\'s', 'Rua Dias da Cruz, Méier', 'Fast Food', '2015-10-08 21:35:19', '2015-10-08 21:35:19')

	def edit
		@restaurante = Restaurante.find(params[:id])
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 16 LIMIT 1

	def update
		@restaurante = Restaurante.find(params[:id])

		if @restaurante.update_attributes(restaurante_params)
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 16 LIMIT 1
UPDATE `restaurantes` SET `foto_file_name` = 'bobs.jpg', `foto_content_type` = 'image/jpeg', `foto_file_size` = 85883, `foto_updated_at` = '2015-10-20 15:29:27', `updated_at` = '2015-10-20 15:29:27' WHERE `restaurantes`.`id` = 54

	def busca
		@restaurante = Restaurante.find_by nome: params[:nome]
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`nome` = 'Fasano' LIMIT 1