app/controllers/restaurantes_controller.rb

	def index
		#@restaurantes = Restaurante.order :nome
		#render "index"

		@restaurantes = Restaurante.order("nome").page(params['page']).per(3)
---
SELECT  `restaurantes`.* FROM `restaurantes`  ORDER BY nome LIMIT 3 OFFSET 0